// *****************************************************************************
//  概要
//    : パネル制御クラスのヘッダーファイルです。
//  備考
//    : 
//  ---------------------------------------------------------------------------
//  No   : 日時      : 内容
//  ---------------------------------------------------------------------------
//  1    :2024/08/16 : 初版
// *****************************************************************************

#ifndef PANEL_H
#define PANEL_H

// *****************************************************************************
// ■ インクルード
// *****************************************************************************
#include "system.h"

// *****************************************************************************
// ■ defines
// *****************************************************************************
#define TIME_25MS                   (25)

#define INTERVAL_TIME               (TIME_25MS)

#define READ_BUTTON_PIN             (PIN_14)

// *****************************************************************************
// ■ クラス
// *****************************************************************************

class Button
{
    public:

        Button(int pin);

        // member
        unsigned long OnTime;       //[25ms]
        
        // func
        void Read();

    private:

        // member
        int pinNo;
};

class PanelController
{
    public:
        PanelController();

        // member
        Button *ReadButton;

        // func
        void Initialize();

        void MainProcess();
    
    private:
        // member
        on_time Time;

        // func
        char getIsTiming();

        void updateButtons();
};

#endif // PANEL_H